{
    "cosponsoredLegislation": [
        {
            "congress": 118,
            "introducedDate": "2024-07-11",
            "latestAction": {
                "actionDate": "2024-07-11",
                "text": "Referred to the Committee on Transportation and Infrastructure, and in addition to the Committee on Science, Space, and Technology, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned."
            },
            "number": "8996",
            "policyArea": {
                "name": null
            },
            "title": "To enhance safety requirements for trains transporting hazardous materials, and for other purposes.",
            "type": "HR",
            "url": "https://api.congress.gov/v3/bill/118/hr/8996?format=json"
        },
        {
            "congress": 118,
            "introducedDate": "2024-07-11",
            "latestAction": {
                "actionDate": "2024-06-05",
                "text": "Referred to the House Committee on Energy and Commerce."
            },
            "number": "163",
            "policyArea": {
                "name": null
            },
            "title": "Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"New Source Performance Standards for Greenhouse Gas Emissions From New, Modified, and Reconstructed Fossil Fuel-Fired Electric Generating Units; Emission Guidelines for Greenhouse Gas Emissions From Existing Fossil Fuel-Fired Electric Generating Units; and Repeal of the Affordable Clean Energy Rule\".",
            "type": "HJRES",
            "url": "https://api.congress.gov/v3/bill/118/hjres/163?format=json"
        },
        {
            "congress": 118,
            "introducedDate": "2024-06-28",
            "latestAction": {
                "actionDate": "2024-05-02",
                "text": "Referred to the House Committee on Financial Services."
            },
            "number": "8231",
            "policyArea": {
                "name": null
            },
            "title": "James Earl Jones Congressional Gold Medal Act",
            "type": "HR",
            "url": "https://api.congress.gov/v3/bill/118/hr/8231?format=json"
        }
    ],
    "pagination": {
        "count": 3
    },
    "request": {
        "bioguideId": "r000619",
        "contentType": "application/json",
        "format": "json"
    }
}